In [ ]:
Recap
------
DAY1: python programming - procedure style + oops style
DAY2: Functional programming + Numpy + webscraping + json + database
---

pandas 
matplotlib
EDA
ML - model

In [ ]:
numpy     - computing 
pandas    - data analysis - clean - format - filter - aggregate ..//DataFrame - cleaned data
matplotlib - visualization

In [1]:
import pandas
pandas.__version__

'2.0.3'

In [ ]:
Series 
DataFrame
-------------//structures

In [2]:
# dict of list
#
# dictname={'Key1':[Value1,Value2,Value3,...ValueN]}
#          

d={'salesCount':[100,150,200,300]}

In [3]:
import pandas
pandas.Series(d)

salesCount    [100, 150, 200, 300]
dtype: object

In [6]:
d={'salesCount':[100,150,200,300],'Qty':[1000,2000,3000,4000]}
pandas.Series(d)

salesCount        [100, 150, 200, 300]
Qty           [1000, 2000, 3000, 4000]
dtype: object

In [7]:
pandas.DataFrame(d)

   salesCount   Qty
0         100  1000
1         150  2000
2         200  3000
3         300  4000

In [9]:
pandas.DataFrame(d['salesCount'])

     0
0  100
1  150
2  200
3  300

In [11]:
pandas.DataFrame(d['salesCount'],columns=['K1'],index=['A','B','C','D'])

    K1
A  100
B  150
C  200
D  300

In [12]:
df1 = pandas.DataFrame(d['salesCount'],columns=['K1'],index=['A','B','C','D'])
df1.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df1['K1']

A    100
B    150
C    200
D    300
Name: K1, dtype: int64

In [14]:
df1.loc['A']

K1    100
Name: A, dtype: int64

In [15]:
print(df1.index,df1.columns)

Index(['A', 'B', 'C', 'D'], dtype='object') Index(['K1'], dtype='object')

In [16]:
# pandas dataframe - mutable 
df1.loc['A'] = 45
df1

    K1
A   45
B  150
C  200
D  300

In [18]:
import pandas as pd
print(pd.DataFrame)

<class 'pandas.core.frame.DataFrame'>

pandas/
     |__core/
           |__frame.py
                |_______class DataFrame:
                              ...

In [19]:
pd.DataFrame({'pid':[101,102,103,104,105],
              'pname':['pA','pB','pC','pD','pE'],
              'pcost':[1000,2000,3000,4000,5000]})

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000

In [20]:
df2 = pd.DataFrame({'pid':[101,102,103,104,105],
              'pname':['pA','pB','pC','pD','pE'],
              'pcost':[1000,2000,3000,4000,5000]})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     5 non-null      int64
 1   pname   5 non-null      object
 2   pcost   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [21]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df2.loc[1]

pid       102
pname      pB
pcost    2000
Name: 1, dtype: object

In [23]:
df2.loc[1:3]

   pid pname  pcost
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000

In [24]:
df2.loc[2:]

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000

In [25]:
df2.loc[:2] # from 0th index to 2nd index

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [26]:
df2['pid']

0    101
1    102
2    103
3    104
4    105
Name: pid, dtype: int64

In [30]:
df2.loc[1:3]['pid']

1    102
2    103
3    104
Name: pid, dtype: int64

In [31]:
df2.loc[1:3]['pname']

1    pB
2    pC
3    pD
Name: pname, dtype: object

In [32]:
df2.loc[1:3][['pid','pname']] # Row X cols

   pid pname
1  102    pB
2  103    pC
3  104    pD

In [33]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000

In [34]:
df2.columns

Index(['pid', 'pname', 'pcost'], dtype='object')

In [35]:
pd.read_csv('E:\\emp.csv')

   eid  ename  edept     eplace  ecost
0  101    raj  sales       pune   1000
1  102    leo   prod     bglore   2000
2  103   paul     HR    chennai   3000
3  104    anu     hr  hyderabad   4000
4  456  kumar  sales     bglore   3000
5  105   zion     Hr     mumbai   5000
6  106   bibu  sales     bglore   1450
7  107  theeb  sales      noida   4590
8  108   bibu  sales     bglore   5000
9  113  kumar   prod  hyderabad   5423

In [36]:
df3 = pd.read_csv('E:\\emp.csv')
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     10 non-null     int64
 1   ename   10 non-null     object
 2   edept   10 non-null     object
 3   eplace  10 non-null     object
 4   ecost   10 non-null     int64
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [37]:
df3.index

RangeIndex(start=0, stop=10, step=1)

In [38]:
df3.columns

Index(['eid', 'ename', 'edept', 'eplace', 'ecost'], dtype='object')

In [39]:
df3.loc[3]

eid             104
ename           anu
edept            hr
eplace    hyderabad
ecost          4000
Name: 3, dtype: object

In [40]:
df3.loc[3][['eid','ename','eplace']]

eid             104
ename           anu
eplace    hyderabad
Name: 3, dtype: object

In [41]:
df3.loc[3:][['eid','ename','eplace']]

   eid  ename     eplace
3  104    anu  hyderabad
4  456  kumar     bglore
5  105   zion     mumbai
6  106   bibu     bglore
7  107  theeb      noida
8  108   bibu     bglore
9  113  kumar  hyderabad

In [42]:
df3.loc[3:5][['eid','ename','eplace']]

   eid  ename     eplace
3  104    anu  hyderabad
4  456  kumar     bglore
5  105   zion     mumbai

In [43]:
df3

   eid  ename  edept     eplace  ecost
0  101    raj  sales       pune   1000
1  102    leo   prod     bglore   2000
2  103   paul     HR    chennai   3000
3  104    anu     hr  hyderabad   4000
4  456  kumar  sales     bglore   3000
5  105   zion     Hr     mumbai   5000
6  106   bibu  sales     bglore   1450
7  107  theeb  sales      noida   4590
8  108   bibu  sales     bglore   5000
9  113  kumar   prod  hyderabad   5423

In [45]:
pd.read_csv('E:\\emp.csv',index_col='eid')

     ename  edept     eplace  ecost
eid
101    raj  sales       pune   1000
102    leo   prod     bglore   2000
103   paul     HR    chennai   3000
104    anu     hr  hyderabad   4000
456  kumar  sales     bglore   3000
105   zion     Hr     mumbai   5000
106   bibu  sales     bglore   1450
107  theeb  sales      noida   4590
108   bibu  sales     bglore   5000
113  kumar   prod  hyderabad   5423

In [46]:
pd.read_csv('E:\\emp.csv',index_col=0)

     ename  edept     eplace  ecost
eid
101    raj  sales       pune   1000
102    leo   prod     bglore   2000
103   paul     HR    chennai   3000
104    anu     hr  hyderabad   4000
456  kumar  sales     bglore   3000
105   zion     Hr     mumbai   5000
106   bibu  sales     bglore   1450
107  theeb  sales      noida   4590
108   bibu  sales     bglore   5000
113  kumar   prod  hyderabad   5423

In [47]:
df4 = pd.read_csv('E:\\emp.csv',index_col='eid')
df4.index

Index([101, 102, 103, 104, 456, 105, 106, 107, 108, 113], dtype='int64', name='eid')

In [48]:
df4.loc[101]

ename       raj
edept     sales
eplace     pune
ecost      1000
Name: 101, dtype: object

In [49]:
df4.loc[101:456]

     ename  edept     eplace  ecost
eid
101    raj  sales       pune   1000
102    leo   prod     bglore   2000
103   paul     HR    chennai   3000
104    anu     hr  hyderabad   4000
456  kumar  sales     bglore   3000

In [50]:
df5 = pd.read_csv('E:\\emp.csv',index_col='edept')
df5

       eid  ename     eplace  ecost
edept
sales  101    raj       pune   1000
prod   102    leo     bglore   2000
HR     103   paul    chennai   3000
hr     104    anu  hyderabad   4000
sales  456  kumar     bglore   3000
Hr     105   zion     mumbai   5000
sales  106   bibu     bglore   1450
sales  107  theeb      noida   4590
sales  108   bibu     bglore   5000
prod   113  kumar  hyderabad   5423

In [51]:
df5.index

Index(['sales', 'prod', 'HR', 'hr', 'sales', 'Hr', 'sales', 'sales', 'sales',
       'prod'],
      dtype='object', name='edept')

In [52]:
df5.loc['sales']

       eid  ename  eplace  ecost
edept
sales  101    raj    pune   1000
sales  456  kumar  bglore   3000
sales  106   bibu  bglore   1450
sales  107  theeb   noida   4590
sales  108   bibu  bglore   5000

In [ ]:
------------------------------------
House1  House2                  Hn
->        
 name                                   ->
 age                                    ->
 bgroup  
 vac      
 ..
------------------------------------

In [ ]:
df5.loc['sales'][['ename','eplace','ecost']]

In [ ]:
df5.loc['sales'][['ename','eplace','ecost']]